package Lesson4;

public class HW4 {
    public static void main(String[] args) {
        //1 Создать класс "Сотрудник" с полями: ФИО, должность,
        // телефон, зарплата, возраст;
        Employee a = new Employee("Иван", "Иванович", "Иванов",
                "Брокер", "8999999999", 50000, 50);
        //4 Вывести при помощи методов из пункта 3 ФИО и должность.
        System.out.println("Сотрудник: " + a.getName() + " " + a.getSecondname() + " "
                + a.getLastname() + ", должность: " + a.getProfession() + ".");
        System.out.println("===============================================");

        //5 Создать массив из 5 сотрудников. С помощью цикла вывести информацию только о сотрудниках старше 40 лет;
        Employee[] b = new Employee[5];

        b[0] = new Employee("Василий", "Васильевич", "Васильев", "Оценщик", "89991111111", 60000, 45);
        b[1] = new Employee("Петр", "Петрович", "Петров", "Аналитик", "89992222222", 80000, 39);
        b[2] = new Employee("Михаил", "Михайлович", "Михайлов", "PR-менеджер", "89993333333", 40000, 25);
        b[3] = new Employee("Александр", "Александрович", "Александров", "Водитель", "89994444444", 30000, 65);
        b[4] = new Employee("Андрей", "Андреевич", "Андреев", "Начальник Управления", "89995555555", 60000, 46);

        for (int i = 0; i < b.length; i++)
    if (b[i].getAge() > 40) {
        System.out.println(b[i].getName() + " " + b[i].getSecondname() + " " +
                b[i].getLastname() + ", должность: " +  b[i].getProfession() + ", тел.: " +  b[i].getPhone() + ", зарплата: " +
                b[i].getIncome() + ", возраст: " +  b[i].getAge());
    } else {
        System.out.println("нет");
            }
        System.out.println("===============================================");

    }
    }


